podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/1.stage1Folder/peripherals/FLEXIO_MKE15Z7.svd.xml
            <register>
               <name>SHIFTCFG1</name>
               <description>Shifter Configuration N Register</description>
               <addressOffset>0x104</addressOffset>
               <fields>
                  <field>
                     <name>SSTART</name>
                     <description>Shifter Start bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSTOP</name>
                     <description>Shifter Stop bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Stop bit disabled for transmitter/receiver/match store</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Reserved for transmitter/receiver/match store</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSRC</name>
                     <description>Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Shifter N+1 Output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTCFG2</name>
               <description>Shifter Configuration N Register</description>
               <addressOffset>0x108</addressOffset>
               <fields>
                  <field>
                     <name>SSTART</name>
                     <description>Shifter Start bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSTOP</name>
                     <description>Shifter Stop bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Stop bit disabled for transmitter/receiver/match store</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Reserved for transmitter/receiver/match store</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSRC</name>
                     <description>Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Shifter N+1 Output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTCFG3</name>
               <description>Shifter Configuration N Register</description>
               <addressOffset>0x10C</addressOffset>
               <fields>
                  <field>
                     <name>SSTART</name>
                     <description>Shifter Start bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on enable</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Start bit disabled for transmitter/receiver/match store, transmitter loads data on first shift</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs start bit value 0 before loading data on first shift, receiver/match store sets error flag if start bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs start bit value 1 before loading data on first shift, receiver/match store sets error flag if start bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSTOP</name>
                     <description>Shifter Stop bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Stop bit disabled for transmitter/receiver/match store</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Reserved for transmitter/receiver/match store</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Transmitter outputs stop bit value 0 on store, receiver/match store sets error flag if stop bit is not 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Transmitter outputs stop bit value 1 on store, receiver/match store sets error flag if stop bit is not 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSRC</name>
                     <description>Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Shifter N+1 Output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUF0</name>
               <description>Shifter Buffer N Register</description>
               <addressOffset>0x200</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUF</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUF1</name>
               <description>Shifter Buffer N Register</description>
               <addressOffset>0x204</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUF</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUF2</name>
               <description>Shifter Buffer N Register</description>
               <addressOffset>0x208</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUF</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUF3</name>
               <description>Shifter Buffer N Register</description>
               <addressOffset>0x20C</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUF</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBIS0</name>
               <description>Shifter Buffer N Bit Swapped Register</description>
               <addressOffset>0x280</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBIS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBIS1</name>
               <description>Shifter Buffer N Bit Swapped Register</description>
               <addressOffset>0x284</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBIS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBIS2</name>
               <description>Shifter Buffer N Bit Swapped Register</description>
               <addressOffset>0x288</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBIS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBIS3</name>
               <description>Shifter Buffer N Bit Swapped Register</description>
               <addressOffset>0x28C</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBIS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBYS0</name>
               <description>Shifter Buffer N Byte Swapped Register</description>
               <addressOffset>0x300</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBYS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBYS1</name>
               <description>Shifter Buffer N Byte Swapped Register</description>
               <addressOffset>0x304</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBYS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBYS2</name>
               <description>Shifter Buffer N Byte Swapped Register</description>
               <addressOffset>0x308</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBYS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBYS3</name>
               <description>Shifter Buffer N Byte Swapped Register</description>
               <addressOffset>0x30C</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBYS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBBS0</name>
               <description>Shifter Buffer N Bit Byte Swapped Register</description>
               <addressOffset>0x380</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBBS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBBS1</name>
               <description>Shifter Buffer N Bit Byte Swapped Register</description>
               <addressOffset>0x384</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBBS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBBS2</name>
               <description>Shifter Buffer N Bit Byte Swapped Register</description>
               <addressOffset>0x388</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBBS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHIFTBUFBBS3</name>
               <description>Shifter Buffer N Bit Byte Swapped Register</description>
               <addressOffset>0x38C</addressOffset>
               <fields>
                  <field>
                     <name>SHIFTBUFBBS</name>
                     <description>Shift Buffer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
